"""**3. Łączenie DataFrames**

Wczytaj zbiory danych `rating.csv` oraz `parking.csv`. Spróbuj połączyć je wykorzystując metodę `merge`. Pamiętaj o odpowiedniej nazwie kol
"""

In [1]:
## zaimportuj biblioteke
import pandas as pd
import numpy as np

In [8]:
rating_dataframe = pd.read_csv("../data/rating.csv")
parking_dataframe = pd.read_csv("../data/parking.csv")

In [6]:
## wczytaj plik rating.csv z ML-datasets-master i wyświetl 5 przykladowych wierszy
rating_dataframe.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2

In [9]:
## wczytaj plik parking.csv z ML-datasets-master i wyświetl 5 przykladowych wierszy
parking_dataframe.head()

   placeID parking_lot
0   135111      public
1   135110        none
2   135109        none
3   135108        none
4   135107        none

In [12]:
## polacz rating z parkingiem za pomoca funkcje merge - uzyj left joina i lacz po kolumnie placeID
merged = rating_dataframe.merge(parking_dataframe, on="placeID", how="left")

In [13]:
## wyświetls 5 wierszy z polaczonej tabeli
merged.head()

  userID  placeID  rating  food_rating  service_rating parking_lot
0  U1077   135085       2            2               2      public
1  U1077   135038       2            2               1        none
2  U1077   132825       2            2               2        none
3  U1077   135060       1            2               2        none
4  U1068   135104       1            1               2         yes